smdprutser/SWM050/lib/SWM500_tmrse.c
/************************************************* ************************************************** ***************************************
* File name: SWM500_tmrse.c
* Function description: SWM500 multi-function timer TMRSE function driver library
* Technical support: http://www.synwit.com.cn/e/tool/gbook/?bid=1
* Precautions:
* Version date: V1.0.0 June 30, 2013
* Upgrade record:
*
*
*******************************************************************************************************************************************
* @attention
*
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS WITH CODING INFORMATION 
* REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME. AS A RESULT, SYNWIT SHALL NOT BE HELD LIABLE 
* FOR ANY DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE CONTENT 
* OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING INFORMATION CONTAINED HEREIN IN CONN-
* -ECTION WITH THEIR PRODUCTS.
*
* COPYRIGHT 2012 Synwit Technology 
*******************************************************************************************************************************************/
#include "SWM500.h"
#include "SWM500_tmrse.h"

static uint32_t PWMHighFirst0 = 0;			//1 High-level and low-level after PWM square-wave period 0 Low-level after PWM square-wave period
static uint32_t PWMHighFirst1 = 0;			//1 High-level and low-level after PWM square-wave period 0 Low-level after PWM square-wave period

/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_Init()
* Function description: TMRSE timer initialization, including mode selection (timer, counter, PWM output, pulse width measurement, duty cycle 
*				measurement), timing cycle setting, interrupt enable, etc.
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* 			TMRSE_InitStructure * initStruct Structure containing TMRSE timer related settings
* Output: 	one
* Note: 	The corresponding pin must be switched to the correct mode (digital peripheral mode) before calling this function
************************************************** ************************************************** **************************************/
void TMRSE_Init(TMRSE_T * TMRSEx,TMRSE_InitStructure * initStruct)
{
	TMRSE_Open(TMRSEx);						// The bus clock can only be provided to the TMRSE module to read and write module registers
	
	TMRSEx->CTRL.ENA = 0;					// Disable TRMSE before configuring TMRSE				
	TMRSEx->CTRL.VALSAVE = 0;				//This feature is not easy to use, and has no uselessness. Discard it under any circumstances
			
	switch((uint32_t)TMRSEx)
	{
	case ((uint32_t)TMRSE0):
		switch(initStruct->mode)
		{
		case 0:								//Timer mode
			TMRSE0->CTRL.WMOD = 0;
			TMRSE0->CTRL.OSCMOD = 0;		//Internal clock
			TMRSE0->CTRL.SINGLE = initStruct->single_cycle;
		
			TMRSE0->TARVAL = initStruct->period;
		
			TMRSE0->CTRL.OUTMOD = initStruct->output_act;
			TMRSE0->OUT_LVL = initStruct->out_initLvl;
			break;
		
		case 1:								//Counter mode
			TMRSE0->CTRL.WMOD = 0;
			TMRSE0->CTRL.OSCMOD = 1;		//External clock
			TMRSE0->CTRL.SINGLE = initStruct->single_cycle;
		
			TMRSE0->CTRL.EDGE_F = initStruct->count_edge;
			TMRSE0->TARVAL = initStruct->period;
		
			TMRSE0->CTRL.OUTMOD = initStruct->output_act;
			TMRSE0->OUT_LVL = initStruct->out_initLvl;
			break;
		
		case 2:								//PWM output mode
			TMRSE0->CTRL.WMOD = 1;
			TMRSE0->CTRL.OSCMOD = initStruct->pwm_clksrc;	
			TMRSE0->CTRL.SINGLE = initStruct->single_cycle;
		
			TMRSE0->CTRL.OUTMOD = 1;		//Output inversion
			TMRSE0->OUT_LVL = (PWMHighFirst0 = initStruct->out_initLvl);
		
			TMRSE0->TARVAL = (PWMHighFirst0==0) ? (initStruct->pwm_l + (initStruct->pwm_h<<16)) :
												  (initStruct->pwm_h + (initStruct->pwm_l<<16));
			break;
		
		case 3:								//Pulse width measurement mode
			TMRSE0->CTRL.WMOD = 2;
			TMRSE0->CTRL.OSCMOD = 0;		//Internal clock
			TMRSE0->CTRL.SINGLE = initStruct->single_cycle;
			
			TMRSE0->CTRL.EDGE_F = initStruct->cap_trigger;
		
			TMRSE0->TARVAL = initStruct->period;
		
			TMRSE0->CTRL.OUTMOD = initStruct->output_act;
			TMRSE0->OUT_LVL = initStruct->out_initLvl;
			break;
		
		case 4:								//Duty cycle measurement mode
			TMRSE0->CTRL.WMOD = 3;
			TMRSE0->CTRL.OSCMOD = 0;		//Internal clock
			TMRSE0->CTRL.SINGLE = initStruct->single_cycle;
		
			TMRSE0->CTRL.EDGE_F = initStruct->cap_trigger;
		
			TMRSE0->TARVAL = initStruct->period;
		
			TMRSE0->CTRL.OUTMOD = initStruct->output_act;
			TMRSE0->OUT_LVL = initStruct->out_initLvl;
			break;
		}

		TMRSE0->INTCTRL.ENA =   1;		//Makes it always possible to query interrupt status via INTSTAT
		TMRSE0->INTCTRL.MASKn = (initStruct->en_int == 1) ? 1 : 0;
		if(initStruct->en_int == 1)
		{
			NVIC_EnableIRQ(TMRSE0_IRQn);
		}
		break;
	
	case ((uint32_t)TMRSE1):
		switch(initStruct->mode)
		{
		case 0:								//Timer mode
			TMRSE1->CTRL.WMOD = 0;
			TMRSE1->CTRL.OSCMOD = 0;		//Internal clock
			TMRSE1->CTRL.SINGLE = initStruct->single_cycle;
		
			TMRSE1->TARVAL = initStruct->period;
		
			TMRSE1->CTRL.OUTMOD = initStruct->output_act;
			TMRSE1->OUT_LVL = initStruct->out_initLvl;
			break;
		
		case 1:								//Counter mode
			TMRSE1->CTRL.WMOD = 0;
			TMRSE1->CTRL.OSCMOD = 1;		//External clock
			TMRSE1->CTRL.SINGLE = initStruct->single_cycle;
		
			TMRSE1->CTRL.EDGE_F = initStruct->count_edge;
			TMRSE1->TARVAL = initStruct->period;
		
			TMRSE1->CTRL.OUTMOD = initStruct->output_act;
			TMRSE1->OUT_LVL = initStruct->out_initLvl;
			break;
		
		case 2:								//PWM output mode
			TMRSE1->CTRL.WMOD = 1;
			TMRSE1->CTRL.OSCMOD = initStruct->pwm_clksrc;	
			TMRSE1->CTRL.SINGLE = initStruct->single_cycle;
		
			TMRSE1->CTRL.OUTMOD = 1;		//Output inversion
			TMRSE1->OUT_LVL = (PWMHighFirst1 = initStruct->out_initLvl);
		
			TMRSE1->TARVAL = (PWMHighFirst1==0) ? (initStruct->pwm_l + (initStruct->pwm_h<<16)) :
												  (initStruct->pwm_h + (initStruct->pwm_l<<16));
			break;
		
