smdprutser/SWM050/lib/SWM500_tmrse.c
		case 3:								//Pulse width measurement mode
			TMRSE1->CTRL.WMOD = 2;
			TMRSE1->CTRL.OSCMOD = 0;		//Internal clock
			TMRSE1->CTRL.SINGLE = initStruct->single_cycle;
			
			TMRSE1->CTRL.EDGE_F = initStruct->cap_trigger;
		
			TMRSE1->TARVAL = initStruct->period;
		
			TMRSE1->CTRL.OUTMOD = initStruct->output_act;
			TMRSE1->OUT_LVL = initStruct->out_initLvl;
			break;
		
		case 4:								//Duty cycle measurement mode
			TMRSE1->CTRL.WMOD = 3;
			TMRSE1->CTRL.OSCMOD = 0;		//Internal clock
			TMRSE1->CTRL.SINGLE = initStruct->single_cycle;
		
			TMRSE1->CTRL.EDGE_F = initStruct->cap_trigger;
		
			TMRSE1->TARVAL = initStruct->period;
		
			TMRSE1->CTRL.OUTMOD = initStruct->output_act;
			TMRSE1->OUT_LVL = initStruct->out_initLvl;
			break;
		}

		TMRSE1->INTCTRL.ENA =   1;		//Makes it always possible to query interrupt status via INTSTAT
		TMRSE1->INTCTRL.MASKn = (initStruct->en_int == 1) ? 1 : 0;
		if(initStruct->en_int == 1)
		{
			NVIC_EnableIRQ(TMRSE1_IRQn);
		}
		break;
	}
}

/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_Open()
* Function description: TMRSE timer enable, enable refers to provide the work clock for TMRSE module
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* Output: 	None
* Note: 	The module register read/write operation does not work after the module clock is turned off
************************************************** ************************************************** **************************************/
void TMRSE_Open(TMRSE_T * TMRSEx)
{
	switch((uint32_t)TMRSEx)
	{
	case ((uint32_t)TMRSE0):
		SYS->PCLK_EN.TMRSE0_CLK = 1;
		break;
	
	case ((uint32_t)TMRSE1):
		SYS->PCLK_EN.TMRSE1_CLK = 1;
		break;
	}
}


/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_Close()
* Function description: TMRSE timer disable, disable refers to cut off the TMRSE module clock supply, thereby reducing energy consumption
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* Output: 	None
* Note: 	The module register read/write operation does not work after the module clock is turned off
************************************************** ************************************************** **************************************/
void TMRSE_Close(TMRSE_T * TMRSEx)
{
	switch((uint32_t)TMRSEx)
	{
	case ((uint32_t)TMRSE0):
		SYS->PCLK_EN.TMRSE0_CLK = 0;
		break;
	
	case ((uint32_t)TMRSE1):
		SYS->PCLK_EN.TMRSE1_CLK = 0;
		break;
	}
}

/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_Start()
* Function description: Start the specified TMRSE, start timing/counting
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* Output:	None
* Note: None
************************************************** ************************************************** **************************************/
void TMRSE_Start(TMRSE_T * TMRSEx)
{
	TMRSEx->CTRL.ENA = 1;
}

/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_Stop()
* Function description: Turn off the specified TMRSE and stop the timer/count
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* Output: 	None
* Note: 	None
************************************************** ************************************************** **************************************/
void TMRSE_Stop(TMRSE_T * TMRSEx)
{
	TMRSEx->CTRL.ENA = 0;
}

/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_SetMode()
* Function Description: Set TMRSE working mode
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* 			uint32_t mode 0 Timer 1 Counter 2 PWM 3 Pulse Width Measurement 4 Duty Cycle Measurement
* Output: 	None
* Note: 	The working mode can be modified only when TMRSE is stopped
************************************************** ************************************************** **************************************/
void TMRSE_SetMode(TMRSE_T * TMRSEx,uint32_t mode)
{
	TMRSEx->CTRL.WMOD = (mode==0) ? 0 : (mode-1);
	
	switch(mode)
	{
	case 0:
		TMRSEx->CTRL.OSCMOD = 0;	//Internal clock
		break;
	
	case 1:
		TMRSEx->CTRL.OSCMOD = 1;	//External clock
		break;
	
	case 3:
	case 4:
		TMRSEx->CTRL.OSCMOD = 0;	//Internal clock
		break;
	}
}

/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_GetMode()
* Function description: Query TMRSE working mode
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* Output: 	0 Timer 1 Counter 2 PWM 3 Pulse Width Measurement 4 Duty Cycle Measurement
* Note: 	None
************************************************** ************************************************** **************************************/
uint32_t TMRSE_GetMode(TMRSE_T * TMRSEx)
{
	uint32_t mode;
	
	mode = TMRSEx->CTRL.WMOD+1;
	
	if((mode==1) && (TMRSEx->CTRL.OSCMOD==0)) mode = 0;
	
	return mode;
}

/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_SetLoop()
* Function Description: Set cycle mode
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* 			uint32_t single 1 single mode 0 circular mode
* Output: 	None
* Note: 	The cycle mode can be modified only when TMRSE is stopped
************************************************** ************************************************** **************************************/
void TMRSE_SetLoop(TMRSE_T * TMRSEx,uint32_t single)
{
	TMRSEx->CTRL.SINGLE = single;
}

