smdprutser/SWM050/lib/SWM500_tmrse.c
/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_GetLoop()
* Function description: Query the TMRSE cycle mode
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* Output: 	1 Single Mode 0 Loop Mode
* Note: 	None
************************************************** ************************************************** **************************************/
uint32_t TMRSE_GetLoop(TMRSE_T * TMRSEx)
{
	return TMRSEx->CTRL.SINGLE;
}

/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_SetCountEdge()
* Function description: Set count-up edge in counter mode
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* 			uint32_t edge_f 1 falling edge 0 rising edge
* Output: 	None
* Note: 	None
************************************************** ************************************************** **************************************/
void TMRSE_SetCountEdge(TMRSE_T * TMRSEx,uint32_t edge_f)
{
	TMRSEx->CTRL.EDGE_F = edge_f;
}

/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_GetCountEdge()
* Function description: Accumulate count edge in query counter mode
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* Output: 	1 Falling edge 0 Rising edge
* Note: 	None
************************************************** ************************************************** **************************************/
uint32_t TMRSE_GetCountEdge(TMRSE_T * TMRSEx)
{
	return TMRSEx->CTRL.EDGE_F;
}

/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_SetPWMClkSrc()
* Function description: Set the PWM mode clock source
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* 			uint32_t ext 0 Internal Clock 1 External Clock
* Output:	None
* Note: 	The clock source can only be modified when TMRSE is stopped.
************************************************** ************************************************** **************************************/
void TMRSE_SetPWMClkSrc(TMRSE_T * TMRSEx,uint32_t ext)
{
	TMRSEx->CTRL.OSCMOD = ext;
}

/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_GetPWMClkSrc()
* Function description: Query PWM mode clock source
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* Output: 	0 Internal clock 1 External clock
* Note: 	None
************************************************** ************************************************** **************************************/
uint32_t TMRSE_GetPWMClkSrc(TMRSE_T * TMRSEx)
{
	return TMRSEx->CTRL.OSCMOD;
}

/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_SetOutputAct()
* Function description: It is used to set the timer/counter to record the cycle value or pulse width measurement detects the second edge, and 
*				the output pin action is detected when the duty cycle measurement detects the third edge.
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* 			uint32_t act 00 No output 01 Invert 10 Set high 11 Set low
* Output: 	None
* Note: 	The output pin action can be modified only when TMRSE is stopped
* 			This value does not need to be set in PWM mode because forced pin inversion in PWM mode
************************************************** ************************************************** **************************************/
void TMRSE_SetOutputAct(TMRSE_T * TMRSEx,uint32_t act)
{
	TMRSEx->CTRL.OUTMOD = act;
}

/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_GetOutputAct()
* Function description: Query output pin action
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* Output: 	00 No output 01 Inverted 10 Set high 11 Set low
* Note: 	None
************************************************** ************************************************** **************************************/
uint32_t TMRSE_GetOutputAct(TMRSE_T * TMRSEx)
{
	return TMRSEx->CTRL.OUTMOD;
}

/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_SetOutputLvl()
* Function Description: Set output pin level
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* 			uint32_t lvl 0 low 1 high
* Output: 	None
* Note: 	None
************************************************** ************************************************** **************************************/
void TMRSE_SetOutputLvl(TMRSE_T * TMRSEx,uint32_t lvl)
{
	TMRSEx->OUT_LVL = lvl;
}

/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_GetOutputLvl()
* Function description: Query output pin level
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* Output: 	0 low 1 high
* Note: 	None
************************************************** ************************************************** **************************************/
uint32_t TMRSE_GetOutputLvl(TMRSE_T * TMRSEx)
{
	return TMRSEx->OUT_LVL;
}

/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_SetCAPTrigger()
* Function description: Set pulse width measurement and duty cycle measurement trigger edge
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* Output: 	uint32_t edge_f 1 Falling edge 0 Rising edge
* Note: 	The capture trigger edge can only be modified when TMRSE is stopped
************************************************** ************************************************** **************************************/
void TMRSE_SetCAPTrigger(TMRSE_T * TMRSEx,uint32_t edge_f)
{
	TMRSEx->CTRL.EDGE_F = edge_f;
}

