smdprutser/SWM050/lib/SWM500_tmrse.c
/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_GetCAPTrigger()
* Function description: Query pulse width measurement and duty cycle measurement trigger edge
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* Output: 	1 Falling edge 0 Rising edge
* Note: 	None
************************************************** ************************************************** **************************************/
uint32_t TMRSE_GetCAPTrigger(TMRSE_T * TMRSEx)
{
	return TMRSEx->CTRL.EDGE_F;
}

/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_SetPeriod()
* Function description: Set the number of counts or timing of the specified TMRSE (in CPU clock cycles)
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* 			uint32_t period The number of TMRSE counts or timing (in CPU clock cycles)
* Output: 	None
* Note: 	None
************************************************** ************************************************** **************************************/
void TMRSE_SetPeriod(TMRSE_T * TMRSEx,uint32_t period)
{
	TMRSEx->TARVAL = period;
}

/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_GetPeriod()
* Function description: Query the number of counts or timing of the specified TMRSE (in CPU clock cycles)
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* Output: 	Count or count time of TMRSE (in CPU clock cycles)
* Note: 	None
************************************************** ************************************************** **************************************/
uint32_t TMRSE_GetPeriod(TMRSE_T * TMRSEx)
{
	return TMRSEx->TARVAL;
}

/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_GetCurrent()
* Function description: Query the current count value (counter mode) or the current timing value (in CPU clock cycles) of the specified TMRSE
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* Output: 	Current count value (counter mode) or current count value (in CPU clock cycles)
* Note: 	None
************************************************** ************************************************** **************************************/
uint32_t TMRSE_GetCurrent(TMRSE_T * TMRSEx)
{
	return TMRSEx->CURVAL;
}

/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_SetPWMLow()
* Function description: Set the PWM waveform low-level period length in units of CPU clock cycles
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* 			uint32_t count PWM waveform low period duration in CPU clock cycles
* Output: 	None
* Note: 	None
************************************************** ************************************************** **************************************/
void TMRSE_SetPWMLow(TMRSE_T * TMRSEx,uint32_t count)
{
	switch((uint32_t)TMRSEx)
	{
	case ((uint32_t)TMRSE0):
		TMRSE0->TARVAL = (PWMHighFirst0==0) ? (count + (TMRSE0->TARVAL&(0xFFFFU<<16))) :
											  ((TMRSE0->TARVAL&0xFFFFU) + (count<<16));
		break;
	
	case ((uint32_t)TMRSE1):
		TMRSE1->TARVAL = (PWMHighFirst1==0) ? (count + (TMRSE1->TARVAL&(0xFFFFU<<16))) :
											  ((TMRSE1->TARVAL&0xFFFFU) + (count<<16));
		break;
	}
}

/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_GetPWMLow()
* Function description: Query PWM waveform low-level period length in CPU clock period
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* Output: 	PWM waveform low-level period length in CPU clock cycles
* Note: 	None
************************************************** ************************************************** **************************************/
uint32_t TMRSE_GetPWMLow(TMRSE_T * TMRSEx)
{
	switch((uint32_t)TMRSEx)
	{
	case ((uint32_t)TMRSE0):
		return (PWMHighFirst0==0) ? (TMRSE0->TARVAL&0xFFFF) :
								    ((TMRSE0->TARVAL>>16)&0xFFFF);

	case ((uint32_t)TMRSE1):
		return (PWMHighFirst1==0) ? (TMRSE1->TARVAL&0xFFFF) :
								    ((TMRSE1->TARVAL>>16)&0xFFFF);
	
	default: return 0xFFFFFFFF;
	}
}

/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_SetPWMHigh()
* Function Description: Set the PWM waveform high time duration, in units of CPU clock cycles
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* 			uint32_t count High-level time length of the PWM waveform in CPU clock cycles
* Output: 	None
* Note: 	None
************************************************** ************************************************** **************************************/
void TMRSE_SetPWMHigh(TMRSE_T * TMRSEx,uint32_t count)
{
	switch((uint32_t)TMRSEx)
	{
	case ((uint32_t)TMRSE0):
		TMRSE0->TARVAL = (PWMHighFirst0==0) ? ((TMRSE0->TARVAL&0xFFFFU) + (count<<16)) :
											  (count + (TMRSE0->TARVAL&(0xFFFFU<<16)));
		break;
	
	case ((uint32_t)TMRSE1):
		TMRSE1->TARVAL = (PWMHighFirst1==0) ? ((TMRSE1->TARVAL&0xFFFFU) + (count<<16)) :
											  (count + (TMRSE1->TARVAL&(0xFFFFU<<16)));
		break;
	}
}

/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_GetPWMHigh()
* Function description: Query PWM waveform high-level period length in CPU clock period
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* Output: 	Duration of PWM waveform high period in CPU clock cycles
* Note: 	None
************************************************** ************************************************** **************************************/
uint32_t TMRSE_GetPWMHigh(TMRSE_T * TMRSEx)
{
	switch((uint32_t)TMRSEx)
	{
	case ((uint32_t)TMRSE0):
		return (PWMHighFirst0==0) ? ((TMRSE0->TARVAL>>16)&0xFFFF) :
								    (TMRSE0->TARVAL&0xFFFF);

	case ((uint32_t)TMRSE1):
		return (PWMHighFirst1==0) ? ((TMRSE1->TARVAL>>16)&0xFFFF) :
								    (TMRSE1->TARVAL&0xFFFF);
	
	default: return 0xFFFFFFFF;
	}
}

