smdprutser/SWM050/lib/SWM500_tmrse.c
/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_SetPWMLowHig()
* Function description: Simultaneously set PWM waveform low-level period and high-level period length in CPU clock period
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* 			uint32_t low PWM waveform low period duration in CPU clock cycles
* 			uint32_t high Duration of PWM waveform high period in CPU clock cycles
* Output: 	None
* Note: 	None
************************************************** ************************************************** **************************************/
void TMRSE_SetPWMLowHig(TMRSE_T * TMRSEx,uint32_t low,uint32_t high)
{
	switch((uint32_t)TMRSEx)
	{
	case ((uint32_t)TMRSE0):
		TMRSE0->TARVAL = (PWMHighFirst0==0) ? (low + (high<<16)) :
											  (high + (low<<16));

		break;
	
	case ((uint32_t)TMRSE1):
		TMRSE1->TARVAL = (PWMHighFirst1==0) ? (low + (high<<16)) :
											  (high + (low<<16));

		break;
	}
}

/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_GetCAPPulse()
* Function description: In the pulse width measurement mode, the captured pulse width is returned (in CPU clock cycles)
* 				Return to the captured waveform cycle (in CPU clock cycles) in duty cycle measurement mode
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* Output: 	pulse width
* Note: 	None
************************************************** ************************************************** **************************************/
uint32_t TMRSE_GetCAPPulse(TMRSE_T * TMRSEx)
{
	return TMRSEx->CAPVAL;
}

/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_GetCAPPulseFP()
* Function description: FP means Front Part, which is the pulse width of the first half of the captured waveform in the duty cycle measurement mode (in CPU clock cycles)
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* Output: 	1 Falling edge 0 Rising edge
* Note: 	None
************************************************** ************************************************** **************************************/
uint32_t TMRSE_GetCAPPulseFP(TMRSE_T * TMRSEx)
{
	return TMRSEx->CAPHALF;
}

/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_GetCurrentPos()
* Function description: Current position status, used in PWM mode and duty cycle mode to judge whether the current is in the first half cycle or the latter half cycle
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* Output: 	0 is currently in the first half cycle 1 is currently in the second half of the cycle
* Note: 	None
************************************************** ************************************************** **************************************/
uint32_t TMRSE_GetCurrentPos(TMRSE_T * TMRSEx)
{
	return TMRSEx->STATE_P;
}

/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_INTEn()
* Function Description: Enables the specified TMRSE interrupt
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* Output: 	None
* Note:		None
************************************************** ************************************************** **************************************/
void TMRSE_INTEn(TMRSE_T * TMRSEx)
{
	TMRSEx->INTCTRL.ENA =   1;		//Makes it always possible to query interrupt status via INTSTAT
	TMRSEx->INTCTRL.MASKn = 1;
	
	switch((uint32_t)TMRSEx)
	{
	case ((uint32_t)TMRSE0):
		NVIC_EnableIRQ(TMRSE0_IRQn);
		break;
	
	case ((uint32_t)TMRSE1):
		NVIC_EnableIRQ(TMRSE1_IRQn);
		break;
	}
}

/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_INTDis()
* Function Description: Disables the specified TMRSE interrupt
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* Output: 	None
* Note: 	None
************************************************** ************************************************** **************************************/
void TMRSE_INTDis(TMRSE_T * TMRSEx)
{
	TMRSEx->INTCTRL.MASKn = 0;
}

/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_INTClr()
* Function description: Clear the interrupt flag of the specified TMRSE
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* Output: 	None
* Note: 	None
************************************************** ************************************************** **************************************/
void TMRSE_INTClr(TMRSE_T * TMRSEx)
{
	TMRSE_GetCurrent(TMRSEx);			//Read current value clear interrupt
}

/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_INTStat()
* Function Description: Get the interrupt status of the specified TMRSE
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* Output: 	1 Interrupt occurred 0 No interrupt occurred
* Note: 	This driver library ensures that TMRSE_INTStat() always returns the same value as TMRSE_INTRawStat(), so TMRSE_INTStat() always returns the correct interrupt status.
************************************************** ************************************************** **************************************/
uint32_t TMRSE_INTStat(TMRSE_T * TMRSEx)
{
	return TMRSEx->INTSTAT;
}

/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_INTRawStat()
* Function Description: Get the original status of the specified TMRSE
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* Output: 	1 Interrupt occurred 0 No interrupt occurred
* Note: 	None
************************************************** ************************************************** **************************************/
uint32_t TMRSE_INTRawStat(TMRSE_T * TMRSEx)
{
	return TMRSEx->INTRSTAT;
}

/************************************************* ************************************************** ***************************************
* Function Name: TMRSE_INTOVStat()
* Function Description: Get the interrupt status of the specified TMRSE Overflow
* Input: 	TMRSE_T * TMRSEx specifies the timer to be set. Valid values include TMRSE
* Output: 	1 Interruption occurred Overflow 0 No interruption occurred Overflow
* Note: 	None
************************************************** ************************************************** **************************************/
uint32_t TMRSE_INTOVStat(TMRSE_T * TMRSEx)
{
	return TMRSEx->INTOFLAG;
}

